export const AboutUsCommon = () => {
  return (
    <section className="pt-[80px] pb-[80px]">
      <div className="container space-y-12">
        <div className="space-y-4">
          <h2 className="text-3xl font-bold">О нас</h2>

          <p className="text-theme-grey-100">
            Мы — команда профессионалов, которая уже более 7 лет занимается
            организацией безопасной и своевременной доставки автомобилей по всей
            России. От частных клиентов до автосалонов и корпоративных
            заказчиков — мы помогаем каждому клиенту перевезти автомобиль без
            стресса и лишней бюрократии.
          </p>
        </div>

        <div className="space-y-4">
          <h2 className="text-3xl font-bold">Наша миссия</h2>

          <p className="text-theme-grey-100">
            Мы верим, что перевозка автомобиля не должна быть сложной. Наша цель
            — сделать этот процесс максимально удобным, безопасным и понятным
            для каждого клиента.
          </p>
        </div>

        <div className="space-y-4">
          <h2 className="text-3xl font-bold">Мы открыты для сотрудничества</h2>

          <p className="text-theme-grey-100">
            Работаем как с частными заказами, так и на постоянной основе с
            автосалонами, дилерами, логистическими и страховыми компаниями.
            Интересует партнёрство? — Напишите нам, и мы обсудим детали.
          </p>
        </div>
      </div>
    </section>
  );
};
